In [5]:
import pandas as pd

In [6]:
df = pd.read_csv('HR Metrics - Sheet1.csv')

In [27]:
df.head()

,employee_id,age,gender,department,job_role,education,marital_status,hire_date,years_at_company,job_level,monthly_income,salary_hike%,overtime,performance_rating,training_times_last_year,work_life_balance,attrition,job_satisfaction,environment_satisfaction,promotion_last_5years
0,EMP0001,50,Male,Marketing,Content Strategist,Doctorate,Divorced,2017-02-10,9,2,5291,11.5,No,4,1,3,No,3,3,Yes
1,EMP0002,36,Male,R&D,Research Scientist,Bachelor,Married,2023-12-02,2,2,5823,19.7,Yes,3,4,3,Yes,4,2,No
2,EMP0003,29,Female,R&D,Lab Technician,Master,Single,2009-01-22,17,3,8259,14.5,No,2,4,1,Yes,4,2,No
3,EMP0004,42,Female,R&D,Research Scientist,Bachelor,Single,2008-08-28,17,3,9205,12.5,No,3,5,3,No,3,2,No
4,EMP0005,40,Female,Marketing,Marketing Analyst,Master,Married,2009-12-30,16,5,16914,12.9,Yes,3,0,3,No,1,3,No

In [8]:
df.columns

Index(['EmployeeID', 'Age', 'Gender', 'Department', 'JobRole', 'Education',
       'MaritalStatus', 'HireDate', 'YearsAtCompany', 'JobLevel',
       'MonthlyIncome', 'SalaryHike%', 'Overtime', 'PerformanceRating',
       'TrainingTimesLastYear', 'WorkLifeBalance', 'Attrition',
       'JobSatisfaction', 'EnvironmentSatisfaction', 'PromotionLast5Years'],
      dtype='object')

In [17]:
# data cleaning
df.columns = df.columns.str.strip().str.lower().str.replace('_', '') # standardize column names
df = df.drop_duplicates() # remove duplicates

In [21]:
print(df.columns.tolist())

['employee_id', 'age', 'gender', 'department', 'job_role', 'education', 'marital_status', 'hire_date', 'years_at_company', 'job_level', 'monthly_income', 'salary_hike%', 'overtime', 'performance_rating', 'training_times_last_year', 'work_life_balance', 'attrition', 'job_satisfaction', 'environment_satisfaction', 'promotion_last_5years']

In [20]:
df.rename(columns={'employeeid': 'employee_id'}, inplace=True)
df.rename(columns={'jobrole': 'job_role'}, inplace=True)
df.rename(columns={'maritalstatus': 'marital_status'}, inplace=True)
df.rename(columns={'hiredate': 'hire_date'}, inplace=True)
df.rename(columns={'yearsatcompany': 'years_at_company'}, inplace=True)
df.rename(columns={'joblevel': 'job_level'}, inplace=True)
df.rename(columns={'monthlyincome': 'monthly_income'}, inplace=True)
df.rename(columns={'salaryhike%': 'salary_hike%'}, inplace=True)
df.rename(columns={'performancerating': 'performance_rating'}, inplace=True)
df.rename(columns={'trainingtimeslastyear': 'training_times_last_year'}, inplace=True)
df.rename(columns={'worklifebalance': 'work_life_balance'}, inplace=True)
df.rename(columns={'jobsatisfaction': 'job_satisfaction'}, inplace=True)
df.rename(columns={'environmentsatisfaction': 'environment_satisfaction'}, inplace=True)
df.rename(columns={'promotionlast5years': 'promotion_last_5years'}, inplace=True)

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 20 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   employee_id               200 non-null    object
 1   age                       200 non-null    int64
 2   gender                    200 non-null    object
 3   department                200 non-null    object
 4   job_role                  200 non-null    object
 5   education                 200 non-null    object
 6   marital_status            200 non-null    object
 7   hire_date                 200 non-null    datetime64[ns]
 8   years_at_company          200 non-null    int64
 9   job_level                 200 non-null    int64
 10  monthly_income            200 non-null    int64
 11  salary_hike%              200 non-null    float64
 12  overtime                  200 non-null    object
 13  performance_rating        200 non-null    int64
 14  training_times_last_year  200 non-null    int64
 15  work_life_balance         200 non-null    int64
 16  attrition                 200 non-null    object
 17  job_satisfaction          200 non-null    int64
 18  environment_satisfaction  200 non-null    int64
 19  promotion_last_5years     200 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(9), object(9)
memory usage: 31.4+ KB

In [25]:
df['hire_date'] = pd.to_datetime(df['hire_date'], dayfirst=True, format='mixed')

In [28]:
df.isnull().sum()

employee_id                 0
age                         0
gender                      0
department                  0
job_role                    0
education                   0
marital_status              0
hire_date                   0
years_at_company            0
job_level                   0
monthly_income              0
salary_hike%                0
overtime                    0
performance_rating          0
training_times_last_year    0
work_life_balance           0
attrition                   0
job_satisfaction            0
environment_satisfaction    0
promotion_last_5years       0
dtype: int64

In [29]:
df = df.drop_duplicates()

In [30]:
!pip install mysql-connector-python sqlalchemy

Requirement already satisfied: mysql-connector-python in c:\users\skill\anaconda3\lib\site-packages (9.5.0)
Requirement already satisfied: sqlalchemy in c:\users\skill\anaconda3\lib\site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\skill\anaconda3\lib\site-packages (from sqlalchemy) (4.15.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\skill\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)

In [32]:
import mysql.connector
from sqlalchemy import create_engine

try:
    db = mysql.connector.connect(
        host="localhost",
        username="root",
        password="password",
        database="hr_analysis"
    )
    print("Connection successful!")
except mysql.connector.Error as err:
    print(f"Error: {err}")

Connection successful!

In [36]:
engine = create_engine('mysql+mysqlconnector://root:password@localhost/hr_analysis')
    
    # Write DataFrame to MySQL
table_name = "employees"
df.to_sql(table_name, con=engine, if_exists='replace', index=False)

200

In [37]:
# Read back sample
pd.read_sql("SELECT * FROM employees LIMIT 10;", engine)

,employee_id,age,gender,department,job_role,education,marital_status,hire_date,years_at_company,job_level,monthly_income,salary_hike%,overtime,performance_rating,training_times_last_year,work_life_balance,attrition,job_satisfaction,environment_satisfaction,promotion_last_5years
0,EMP0001,50,Male,Marketing,Content Strategist,Doctorate,Divorced,2017-02-10,9,2,5291,11.5,No,4,1,3,No,3,3,Yes
1,EMP0002,36,Male,R&D,Research Scientist,Bachelor,Married,2023-12-02,2,2,5823,19.7,Yes,3,4,3,Yes,4,2,No
2,EMP0003,29,Female,R&D,Lab Technician,Master,Single,2009-01-22,17,3,8259,14.5,No,2,4,1,Yes,4,2,No
3,EMP0004,42,Female,R&D,Research Scientist,Bachelor,Single,2008-08-28,17,3,9205,12.5,No,3,5,3,No,3,2,No
4,EMP0005,40,Female,Marketing,Marketing Analyst,Master,Married,2009-12-30,16,5,16914,12.9,Yes,3,0,3,No,1,3,No
5,EMP0006,44,Male,R&D,Lab Technician,Master,Married,2002-08-04,23,4,10289,14.2,Yes,3,6,1,No,3,1,Yes
6,EMP0007,32,Female,IT,Data Analyst,Bachelor,Single,2023-03-07,2,1,2608,20.7,No,2,6,4,Yes,2,3,No
7,EMP0008,32,Female,Sales,Sales Executive,Bachelor,Married,2023-08-22,2,2,4687,22.8,Yes,2,0,4,No,4,3,No
8,EMP0009,45,Male,R&D,Lab Technician,Bachelor,Married,2021-01-25,5,3,9737,24.1,No,4,6,3,Yes,4,2,No
9,EMP0010,57,Male,IT,Software Engineer,Bachelor,Married,2013-04-08,12,4,10888,20.7,Yes,2,0,2,No,3,4,Yes